package by.htp.task02.main;
/*
 * 24. Составить программу, определяющую результат гадания на ромашке — 
 * «любит—не любит», взяв за исходное данное количество лепестков п.
 */
public class Task24 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int n = 14;
		
		if ( n % 2 == 0) {
			System.out.println("Не любит :(((");
		} else {
			System.out.println("Любит!!!! :)))))");
		}
	}

}
