package by.htp.task01.main;
/*

9. Вычислить значение выражения по формуле (все переменные принимают действительные значения):

*/

public class Task09 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		double a = 3.0;
		double b = 4.0;
		double c = 5.0;
		double d = 6.0; 
		
		double result = (a / c) * ( b / d) - ( a * b - c) / (c * d);
		
		System.out.println(result);

	}

}
