package by.htp.task01.main;

/*

7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника

*/

public class Task07 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		double length = 5;
		double width = length / 2;
		
		double area = length * width;
		
		System.out.println(area);

	}

}
