package by.htp.task01.main;
/*

15. Написать программу, которая выводит на экран первые четыре степени числа π.

*/

public class Task15 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		for (int i = 1 ; i <= 4; i++) {
			System.out.println(Math.pow(Math.PI, i));
			
		}

	}

}
