package by.htp.task01.main;

/* 1. Даны два действительных числа х и у. Вычислить их сумму, 
 * разность, произведение и частное.*/

public class Task01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		double x = 10.0;
		double y = 2.0;
		
		double summa = x + y;
		double raznost = x - y;
		double proizvedenie = x * y;
		double chastnoe = x / y;
		System.out.println("Сумма = " + summa);
		System.out.println("Разность = " + raznost);
		System.out.println("Произведение = " + proizvedenie);
		System.out.println("Частное = " + chastnoe);
		
	}

}
